lvx/base/DataProcessors/бит_ПодборНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПодборНоменклатуры</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьЕдиницы</Name>
							<Comment>Себестоимость единицы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Comment>Себестоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Comment>Счет учета</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРезерва</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/DataProcessors/бит_ПодборНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	// Проверим наличие ключа СтруктураПараметров в параметрах формы.
	// При отсутствии не будем запускать подбор.
	Если Не Параметры.Свойство("СтруктураПараметров") Тогда
		фОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	АлгоритмПодбора = Перечисления.бит_му_АлгоритмПодбораНачислениеРезерваПоМПЗ.СУчетомПросрочки;
	
	// Инициализируем настройки компоновщика.
	АдресСхемыКомпоновкиДанных = Обработки.бит_ПодборНоменклатуры.ИнициализироватьКомпоновщик(Объект.Компоновщик, УникальныйИдентификатор, "СУчетомПросрочки");
		
	Элементы.КомпоновщикПользовательскиеНастройки.РежимОтображения = РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ;	
	
	// Заполним структуру параметров.
	Если Параметры.Свойство("СтруктураПараметров") Тогда
		фСтруктураПараметров = Новый Структура;
		Для каждого ТекПараметр Из Параметры.СтруктураПараметров Цикл
			фСтруктураПараметров.Вставить(ТекПараметр.Ключ, ТекПараметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// Установим заголовок формы.
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = Метаданные.Обработки.бит_ПодборНоменклатуры.Синоним + " - " + фСтруктураПараметров.Документ.Ссылка;
    
    Элементы.РезультатНоменклатурнаяГруппа.Видимость = НЕ бит_ОбщегоНазначения.ЭтоСемействоERP();
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		
		Отказ = Истина;		
		ТекстПредупреждения = НСтр("ru='Данная обработка вызывается программно.Вручную ее вызывать запрещено.';
								   |en='This processing is called programmatically. It is forbidden to call it manually..'");
		ПоказатьПредупреждение(, ТекстПредупреждения, 30);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПодбораПриИзменении(Элемент)
	
	АлгоритмПодбораПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПолучитьРезультатЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	ДобавитьВыбранныеСтроки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавить(Команда)
	
	ДобавитьВыбранныеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Результат, "Использование", 2, Элементы.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Результат, "Использование", 0, Элементы.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсе(Команда)

	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Результат, "Использование", 1, Элементы.Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет запрос и заполняет табличную часть "Результат".
// 
&НаСервере
Процедура ПолучитьРезультатЗапроса()

	Если АлгоритмПодбора = Перечисления.бит_му_АлгоритмПодбораНачислениеРезерваПоМПЗ.Простой Тогда
	
		Результат = Обработки.бит_ПодборНоменклатуры.ВыполнитьЗапросПоНастройке(Объект.Компоновщик, 
						АдресСхемыКомпоновкиДанных, фСтруктураПараметров);
		Объект.Результат.Загрузить(Результат);
		
	Иначе	
		Объект.Результат.Очистить();
		Обработки.бит_ПодборНоменклатуры.ВыполнитьЗапросСУчетомПросрочки(Объект.Компоновщик, 
			АдресСхемыКомпоновкиДанных, Объект.Результат, фСтруктураПараметров);
	КонецЕсли; 
	
КонецПроцедуры // ПолучитьРезультатЗапроса() 

// Процедура заполняет ТЧ документа выбранными строками.
// 
// ОчищатьТабличнуюЧасть - Булево.
// 
&НаКлиенте
Процедура ДобавитьВыбранныеСтроки(ОчищатьТабличнуюЧасть)

	МассивСтрокТЧ = Новый Массив;
	
	Для каждого ТекСтр Из Объект.Результат Цикл
		Если ТекСтр.Использование Тогда
			СтрокаТЧ = Новый Структура("Номенклатура, Склад, Количество, ЕдиницаИзмерения, 
									   |СебестоимостьЕдиницы, Себестоимость, СчетУчета, СчетРезерва, Резерв");
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтр);
			МассивСтрокТЧ.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("МассивСтрок", 			МассивСтрокТЧ);
	СтруктураРезультата.Вставить("ОчищатьТабличнуюЧасть", 	ОчищатьТабличнуюЧасть);
	
	ОповеститьОВыборе(СтруктураРезультата);

КонецПроцедуры // ДобавитьВыбранныеСтроки()

// Процедура обработчик события "ПриИзменении" поля АлгоритмПодбора.
//
&НаСервере
Процедура АлгоритмПодбораПриИзмененииСервер()

	Если АлгоритмПодбора = Перечисления.бит_му_АлгоритмПодбораНачислениеРезерваПоМПЗ.СУчетомПросрочки Тогда
	
		ИмяМакета = "СУчетомПросрочки";
		
	Иначе	
		ИмяМакета = "СхемаКомпоновкиДанных";
	КонецЕсли; 
	
	// Инициализируем настройки компоновщика.
	АдресСхемыКомпоновкиДанных = Обработки.бит_ПодборНоменклатуры.ИнициализироватьКомпоновщик(Объект.Компоновщик, УникальныйИдентификатор, ИмяМакета);

КонецПроцедуры // АлгоритмПодбораПриИзмененииСервер()

#КонецОбласти
